<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of micro. and creates a package.</string>
        <key>Identifier</key>
        <string>com.github.nathandarnell-recipes.pkg.micro</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>micro</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.nathandarnell-recipes.download.micro</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Comment</key>
                <string>Create a pkg root; we'll extract things from the disk image here.</string>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkg</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>opt</key>
                        <string>0775</string>
                        <key>opt/local</key>
                        <string>0775</string>
                        <key>opt/local/bin</key>
                        <string>0775</string>
                        <key>opt/share</key>
                        <string>0775</string>
                        <key>opt/share/man</key>
                        <string>0775</string>
                        <key>opt/share/man/man1</key>
                        <string>0775</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Comment</key>
                <string>Copy the micro binary</string>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%-%version%/micro</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/opt/local/bin/micro</string>
                </dict>
            </dict>
            <dict>
                <key>Comment</key>
                <string>Copy the micro man1</string>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%-%version%/micro.1</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/opt/share/man/man1/micro.1</string>
                </dict>
            </dict>
            <dict>
                <key>Comment</key>
                <string>Symlink /Library/AutoPkg/autopkg to /usr/local/bin/autopkg</string>
                <key>Processor</key>
                <string>Symlinker</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>/Library/AutoPkg/autopkg</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/usr/local/bin/autopkg</string>
                </dict>
            </dict>
            <dict>
                <key>Comment</key>
                <string>Make PackageInfo file for our package</string>
                <key>Processor</key>
                <string>PkgInfoCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>template_path</key>
                    <string>PackageInfoTemplate</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>pkgroot</key>
                    <string>%pkgroot%</string>
                    <key>infofile</key>
                    <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                    <key>pkgtype</key>
                    <string>flat</string>
                </dict>
            </dict>
            <dict>
                <key>Comment</key>
                <string>Finally! Build the pkg</string>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgname</key>
                        <string>%NAME%-%version%</string>
                        <key>pkgdir</key>
                        <string>%RECIPE_CACHE_DIR%</string>
                        <key>id</key>
                        <string>com.stisidoreschool.pkg.zyedidia.micro</string>
                        <key>version</key>
                        <string>%version%</string>
                        <key>infofile</key>
                        <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                        <key>resources</key>
                        <string>Resources</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>opt/local/bin/micro</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>opt/share/man/man1/micro.1</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0644</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
            </dict>
        </array>
    </dict>
</plist>