<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest micro and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.nathandarnell-recipes.munki.micro</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>micro</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps</string>
            <key>MUNKI_CATEGORY</key>
            <string>Utilities</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>micro is a terminal-based text editor that aims to be easy to use and intuitive, while also taking advantage of the capabilities of modern terminals. It comes as a single, batteries-included, static binary with no dependencies; you can download and use it right now!</string>
                <key>display_name</key>
                <string>micro</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>developer</key>
                <string>zyedidia</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.nathandarnell-recipes.pkg.micro</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pkg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>