<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created from https://github.com/autopkg/ahousseini-recipes/blob/master/MonitorControl/MonitorControl.download.recipe</string>
		<key>Description</key>
		<string>Downloads the latest version of displayplacer.</string>
		<key>Identifier</key>
		<string>com.github.nathandarnell-recipes.download.displayplacer</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>displaplacer</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>github_repo</key>
					<string>jakehilborn/displayplacer</string>
				</dict>
				<key>Processor</key>
				<string>GitHubReleasesInfoProvider</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%-%version%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
