<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest MonitorControl disk image and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.nathandarnell-recipes.munki.MonitorControl</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>MonitorControl</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps</string>
            <key>MUNKI_CATEGORY</key>
            <string>Utilities</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Controls your external display brightness and volume and shows native OSD. Use menulet sliders or the keyboard, including native Apple keys!</string>
                <key>display_name</key>
                <string>MonitorControl</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>developer</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.ahousseini-recipes.download.MonitorControl</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>Processor</key>
                    <string>AppPkgCreator</string>
                </dict>
                <dict>
                    <key>Arguments</key>
                    <dict>
                        <key>pkg_path</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                        <key>repo_subdirectory</key>
                        <string>%MUNKI_REPO_SUBDIR%</string>
                    </dict>
                    <key>Processor</key>
                    <string>MunkiImporter</string>
                </dict>
            </array>
        </dict>
    </plist>